Repository: harsk03/dialect-translator
Catalog: corpus/Multilingual_Corpus.tmx
Source language: english
Languages: bengali, hindi, marathi, tamil

source: Hello
bengali: হ্যালো
hindi: नमस्ते (Namaste)
marathi: नमस्कार
tamil: வணக்கம்

source: Good morning
bengali: শুভ সকাল
hindi: सुप्रभात (Suprabhat)
marathi: शुभ प्रभात
tamil: காலை வணக்கம்

source: Good evening
bengali: শুভ সন্ধ্যা
hindi: शुभ संध्या (Shubh Sandhya)
marathi: शुभ संध्या
tamil: மாலை வணக்கம்

source: How are you?
bengali: তুমি কেমন আছো?
hindi: कैसे हो? (Kaise ho?)
marathi: तुम्ही कसे आहात?
tamil: நீங்கள் எப்படி இருக்கிறீர்கள்?

source: Nice to meet you
bengali: তোমার সাথে দেখা করে ভালো লাগলো।
hindi: आपसे मिलकर खुशी हुई (Aapse milkar khushi hui)
marathi: तुम्हाला भेटून आनंद झाला
tamil: உங்களை சந்தித்ததில் மகிழ்ச்சி

source: Thank you
bengali: ধন্যবাদ
hindi: धन्यवाद (Dhanyawad)
marathi: धन्यवाद
tamil: நன்றி

source: You're welcome
bengali: আপনাকে স্বাগতম
hindi: आपका स्वागत है (Aapka swagat hai)
marathi: स्वागत आहे
tamil: உங்களை வரவேற்கிறேன்

source: Sorry
bengali: দুঃখিত
hindi: माफ़ कीजिए (Maaf kijiye)
marathi: माफ करा
tamil: மன்னிக்கவும்

source: Please
bengali: অনুগ্রহ করে
hindi: कृपया (Kripya)
marathi: कृपया
tamil: தயவுசெய்து

source: Excuse me
bengali: মাফ করবেন
hindi: मुझे माफ करें (Mujhe maaf karein)
marathi: माफ करा
tamil: மன்னிக்கவும்

source: What's your name?
bengali: তোমার নাম কি?
hindi: आपका नाम क्या है? (Aapka naam kya hai?)
marathi: तुमचे नाव काय?
tamil: உங்கள் பெயர் என்ன?

source: Where are you from?
bengali: তুমি কোথা থেকে আসছো?
hindi: आप कहाँ से हैं? (Aap kahaan se hain?)
marathi: तुम्ही कुठून आला आहात?
tamil: நீங்கள் எங்கே இருந்து வந்தீர்கள்?

source: How old are you?
bengali: তোমার বয়স কত?
hindi: आपकी उम्र कितनी है? (Aapki umra kitni hai?)
marathi: तुमचे वय किती आहे?
tamil: உங்கள் வயது என்ன?

source: What do you do?
bengali: তুমি কি করো?
hindi: आप क्या करते हैं? (Aap kya karte hain?)
marathi: तुम्ही काय करता?
tamil: நீங்கள் என்ன வேலை செய்கிறீர்கள்?

source: How was your day?
bengali: তোমার দিনটা কেমন গেল?
hindi: आप का दिन कैसा था? (Aapka din kaisa tha?)
marathi: तुमचा दिवस कसा गेला?
tamil: உங்கள் நாள் எப்படி இருந்தது?

source: Can you help me?
bengali: তুমি কি আমাকে সাহায্য করতে পারবে?
hindi: क्या आप मेरी मदद कर सकते हैं? (Kya aap meri madad kar sakte hain?)
marathi: तुम्ही मला मदत करू शकता?
tamil: நீங்கள் எனக்கு உதவலாமா?

source: What time is it?
bengali: কয়টা বাজে?
hindi: समय क्या हुआ है? (Samay kya hua hai?)
marathi: आत्ता किती वाजले?
tamil: இது என்ன நேரம்?

source: How much does it cost?
bengali: এটার দাম কত?
hindi: यह कितना खर्च होगा? (Yeh kitna kharch hoga?)
marathi: याची किंमत किती आहे?
tamil: இதற்கு எவ்வளவு காசு?

source: Do you speak English?
bengali: তুমি কি ইংরেজি বলতে পার?
hindi: क्या आप अंग्रेज़ी बोलते हैं? (Kya aap angrezi bolte hain?)
marathi: तुम्हाला इंग्रजी येते का?
tamil: நீங்கள் ஆங்கிலம் பேசுவீர்களா?

source: I don't understand
bengali: আমি বুঝতে পারছি না।
hindi: मैं नहीं समझता (Main nahi samajhta)
marathi: मला समजत नाही
tamil: எனக்குப் புரியவில்லை

source: Where is the nearest bus stop?
bengali: সবচেয়ে কাছের বাস স্টপ কোথায়?
hindi: सबसे नजदीकी बस स्टॉप कहाँ है? (Sabse najdeeki bus stop kahaan hai?)
marathi: सर्वात जवळचे बस थांबे कुठे आहे?
tamil: அருகிலுள்ள பேருந்து நிறுத்தம் எங்கு?

source: Can you show me the way?
bengali: তুমি কি আমাকে পথ দেখাতে পারবে?
hindi: क्या आप मुझे रास्ता दिखा सकते हैं? (Kya aap mujhe raasta dikha sakte hain?)
marathi: तुम्ही मला मार्ग दाखवू शकता का?
tamil: நீங்கள் வழி காட்ட முடியுமா?

source: I need a taxi
bengali: আমার একটা ট্যাক্সি দরকার।
hindi: मुझे टैक्सी चाहिए (Mujhe taxi chahiye)
marathi: मला टॅक्सी हवी आहे
tamil: எனக்கு ஒரு டாக்ஸி வேண்டும்

source: Where is the bathroom?
bengali: বাথরুম কোথায়?
hindi: बाथरूम कहाँ है? (Bathroom kahaan hai?)
marathi: शौचालय कुठे आहे?
tamil: கழிப்பறை எங்கு?

source: Is this seat taken?
bengali: এই সীটে কি কেউ বসেছেন?
hindi: क्या यह सीट ली गई है? (Kya yeh seat li gayi hai?)
marathi: ही जागा घेतली आहे का?
tamil: இந்த இருக்கை ஒதுக்கப்பட்டதா?

source: Can I see the menu?
bengali: আমি কি মেনু দেখতে পারি?
hindi: क्या मैं मेनू देख सकता हूँ? (Kya main menu dekh sakta hoon?)
marathi: मेनू पाहू शकतो का?
tamil: மெனு பார்க்கலாமா?

source: I'll have this
bengali: আমি এটা নেব।
hindi: मैं यह लूँगा (Main yeh loonga)
marathi: मला हे हवे आहे
tamil: நான் இதை எடுத்துக்கொள்கிறேன்

source: Is it spicy?
bengali: এটা কি ঝাল?
hindi: क्या यह मसालेदार है? (Kya yeh masaledar hai?)
marathi: हे तिखट आहे का?
tamil: இது காரமாக இருக்குமா?

source: Do you accept credit cards?
bengali: আপনি কি ক্রেডিট কার্ড গ্রহণ করেন?
hindi: क्या आप क्रेडिट कार्ड स्वीकार करते हैं? (Kya aap credit card sweekar karte hain?)
marathi: तुम्ही क्रेडिट कार्ड स्वीकारता का?
tamil: நீங்கள் கிரெடிட் கார்டு ஏற்கிறீர்களா?

source: I want to buy this
bengali: আমি এটা কিনতে চাই।
hindi: मैं यह खरीदना चाहता हूँ (Main yeh khareedna chahta hoon)
marathi: मला हे विकत घ्यायचे आहे
tamil: நான் இதை வாங்க விரும்புகிறேன்

source: Call the police
bengali: পুলিশ ডাকো।
hindi: पुलिस को बुलाओ (Police ko bulaao)
marathi: पोलिसांना बोलवा
tamil: காவலரை அழைக்கவும்

source: I need a doctor
bengali: আমার একজন ডাক্তার দরকার।
hindi: मुझे डॉक्टर की आवश्यकता है (Mujhe doctor ki avashyakta hai)
marathi: मला डॉक्टर हवा आहे
tamil: எனக்கு மருத்துவர் வேண்டும்

source: Help me
bengali: আমাকে সাহায্য করো।
hindi: मुझे मदद चाहिए (Mujhe madad chahiye)
marathi: मला मदत करा
tamil: எனக்கு உதவி தேவை

source: I'm lost
bengali: আমি হারিয়ে গেছি।
hindi: मैं खो गया हूँ (Main kho gaya hoon)
marathi: मी हरवले आहे
tamil: நான் திசைதிரிந்துவிட்டேன்

source: My wallet is missing
bengali: আমার মানিব্যাগটি হারিয়ে গেছে।
hindi: मेरा बटुआ गुम गया है (Mera batua gum gaya hai)
marathi: माझे पाकीट हरवले आहे
tamil: என் பணப்பை காணவில்லை

source: What’s the weather like today?
bengali: আজ আবহাওয়া কেমন?
hindi: आज मौसम कैसा है? (Aaj mausam kaisa hai?)
marathi: आज हवामान कसे आहे?
tamil: இன்று வானிலை எப்படி?

source: I'm going to work
bengali: আমি কাজ করতে যাচ্ছি।
hindi: मैं काम पर जा रहा हूँ (Main kaam par jaa raha hoon)
marathi: मी कामाला जात आहे
tamil: நான் வேலைக்குப் போகிறேன்

source: I’m feeling tired
bengali: আমি ক্লান্ত বোধ করছি।
hindi: मैं थक गया हूँ (Main thak gaya hoon)
marathi: मी थोडा दमलो आहे
tamil: நான் களைப்பாக இருக்கிறேன்

source: I'll be there soon
bengali: আমি শীঘ্রই সেখানে আসছি।
hindi: मैं जल्द ही पहुँचूंगा (Main jald hi pahunchunga)
marathi: मी लवकरच तिथे असेन
tamil: நான் விரைவில் வந்துவிடுவேன்

source: Can I call you later?
bengali: আমি কি তোমাকে পরে ফোন করতে পারি?
hindi: क्या मैं आपको बाद में फोन कर सकता हूँ? (Kya main aapko baad mein phone kar sakta hoon?)
marathi: मी तुम्हाला नंतर फोन करू शकतो का?
tamil: நான் உங்களை பிறகு அழைக்கலாமா?

source: I love you
bengali: আমি তোমাকে ভালোবাসি
hindi: मैं तुमसे प्यार करता हूँ (Main tumse pyaar karta hoon)
marathi: मी तुझ्यावर प्रेम करतो
tamil: நான் உன்னை காதலிக்கிறேன்

source: I'm happy
bengali: আমি খুশি
hindi: मैं खुश हूँ (Main khush hoon)
marathi: मी आनंदी आहे
tamil: நான் மகிழ்ச்சியாக இருக்கிறேன்

source: I'm sad
bengali: আমি দুঃখিত
hindi: मैं उदास हूँ (Main udaas hoon)
marathi: मी दु:खी आहे
tamil: நான் கவலையாக இருக்கிறேன்

source: I'm hungry
bengali: আমি বিরক্ত।
hindi: मैं भूखा हूँ (Main bhookha hoon)
marathi: मला भूक लागली आहे
tamil: எனக்கு பசிக்கிறது

source: I'm bored
bengali: আমি ক্ষুধার্ত।
hindi: मैं ऊब चुका हूँ (Main oob chuka hoon)
marathi: मला कंटाळा आला आहे
tamil: எனக்கு சலிப்பாக இருக்கிறது

source: Take care
bengali: যত্ন নিও
hindi: ध्यान रखना (Dhyaan rakhna)
marathi: काळजी घ्या
tamil: கவனமாக இருங்கள்

source: Have a nice day
bengali: শুভ দিন
hindi: आपका दिन शुभ हो (Aapka din shubh ho)
marathi: तुमचा दिवस आनंददायक जाओ
tamil: நல்ல நாளாக இருக்கட்டும்

source: See you later
bengali: পরে দেখা হবে।
hindi: फिर मिलेंगे (Phir milenge)
marathi: नंतर भेटू
tamil: பிறகு சந்திப்போம்

source: Goodbye
bengali: বিদায়
hindi: अलविदा (Alvida)
marathi: आलविदा
tamil: விடைபெறுகிறேன்

source: Good luck
bengali: শুভকামনা
hindi: शुभकामनाएँ (Shubhkaamnayein)
marathi: शुभेच्छा
tamil: நீங்கள் வெற்றி பெறட்டும்
